Tekla.Structures.Dialog.StructuresInstallation.GetLocalizationFile(System.String)
Retrieves localization file from configured environment
messageFile:
Returns:

Tekla.Structures.Dialog.StructuresInstallation.MessageFolder
Path to Tekla Structures messages directory.

Tekla.Structures.Dialog.StructuresInstallation.MessagesFolder
List Paths to Tekla Structures messages directories.

Tekla.Structures.Dialog.StructuresInstallation.AddToXsMessages(System.String)
Adds message to xsMessages if not empty
messagePath:

Tekla.Structures.Dialog.StructuresInstallation.ErrorHandler(System.String,System.String,System.String)
prints error message to session log
advancedOption:
invalidString:
exceptionMessage:

Tekla.Structures.Dialog.StructuresInstallation.WriteToSessionLog(System.String)
Adds message to session log, doesn't fail if TS is not running
message: